Tekla Open API Reference for Tekla Structures 2025
RebarLeg.Curve Property
 Gets the curve of the leg
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ICurve Curve { get; }
Public ReadOnly Property Curve As ICurve
	Get
Property Value
Type: ICurve
See Also
Reference
RebarLeg Class
Tekla.Structures.Model Namespace